/**
 * Copyright (c) 2014, Analog Devices, Inc.  All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted (subject to the limitations in the
 * disclaimer below) provided that the following conditions are met:
 *
 * - Redistributions of source code must retain the above copyright
 *   notice, this list of conditions and the following disclaimer.
 *
 * - Redistributions in binary form must reproduce the above copyright
 *   notice, this list of conditions and the following disclaimer in the
 *   documentation and/or other materials provided with the
 *   distribution.
 *
 * - Neither the name of Analog Devices, Inc. nor the names of its
 *   contributors may be used to endorse or promote products derived
 *   from this software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE
 * GRANTED BY THIS LICENSE.  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT
 * HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR

#define READ_SPI      pADI_SPI0->SPIRX

// Bit Manipulation Macros
#define MSKSET_VAL(byte,numbits,offset,value) ((byte & ~(((0x1 << numbits)-1) << offset)) | value)



/*************************************************************************/
/*                Local Types                                 */
/*************************************************************************/
/*************************************************************************/
/*                     Radio Command Codes                               */
/*************************************************************************/
typedef enum
{
   CMD_SYNC        = 0xA2, // Synchronizatio
   CMD_PHY_OFF     = 0xB0, // Transition to state PHY_OFF
   CMD_PHY_ON      = 0xB1, // transition to state PHY_ON
   CMD_PHY_RX      = 0xB2, // transition to state PHY_RX
   CMD_PHY_TX      = 0xB5, // transition to state PHY_TX
   CMD_PHY_SLEEP   = 0xBA, // transition to state PHY_SLEEP
   CMD_CONFIG_DEV  = 0xBB, // Apply Radio Configuration
   CMD_GET_RSSI    = 0xBC, // Performs an RSSI measurement
   CMD_HW_RESET    = 0xC8, // Power Down radio
   SPI_MEM_WR      = 0x18, // Sequential SPI Write
   SPI_MEM_RD      = 0x38, // Sequential SPI Read
   SPI_NOP         = 0xFF  // No operation
} Radio_CmdCodes;
/*************************************************************************/
/*                        Firmware States                                */
/*************************************************************************/
typedef enum
{
    FW_INIT        = 0x0F, // Radio Starting Up
    FW_BUSY        = 0x00, // Radio not completed current operation
    FW_RSSI        = 0x05, // Performing CMD_GET_RSSI
    FW_OFF         = 0x11, // Radio is OFF
    FW_ON          = 0x12, // Radio is ON
    FW_RX          = 0x13, // Radio is in receive mode
    FW_TX          = 0x14, // Radio is in transmit mode

} RadioState;
/*************************************************************************/
/*                        Status Byte Masks                              */
/*************************************************************************/
#define STATUS_BYTE_FW_STATE    (0x1F << 0)
#define STATUS_BYTE_CMD_READY   (0x1  << 5)
#define STATUS_BYTE_IRQ_STATUS  (0x1  << 6)
#define STATUS_BYTE_SPI_READY   (0x1  << 7)
/*************************************************************************/
/*                        SPI Memory Access Defs                         */
/*************************************************************************/
#define SPI_MEMCMD_BYTE0_ADR_MSK       (0x3  << 0)
#define SPI_MEMCMD_BYTE0_CMD_BITOFFSET 3
#define SPI_MEMCMD_BYTE0_CMD_MSK       (0x1F << SPI_MEMCMD_BYTE0_CMD_BITOFFSET)
/*************************************************************************/
/*                        Radio Configuration Structure                  */
/*************************************************************************/
/**
    \internal Hide from Doxegen
    \var TyRadioConfiguration
 **/
typedef struct
{
    RIE_U8 interrupt_mask_0_r;           // 0x100
    RIE_U8 cfg_101_r;                    // 0x101
    RIE_U8 cfg_102_r;                    // 0x102
    RIE_U8 cfg_103_r;                    // 0x103
    RIE_U8 cfg_104_r;                    // 0x104
    RIE_U8 cfg_105_r;                    // 0x105
    RIE_U8 cfg_106_r;                    // 0x106
    RIE_U8 cfg_107_r;                    // 0x107
    RIE_U8 cfg_108_r;                    // 0x108
    RIE_U8 channel_freq_0_r;             // 0x109
    RIE_U8 channel_freq_1_r;             // 0x10A
    RIE_U8 channel_freq_2_r;             // 0x10B
    RIE_U8 cfg_10C_r;                    // 0x10C
    RIE_U8 cfg_10D_r;                    // 0x10D
    RIE_U8 cfg_10E_r;                    // 0x10E
    RIE_U8 cfg_10F_r;                    // 0x10F
    RIE_U8 cfg_110_r;                    // 0x110
    RIE_U8 cfg_111_r;                    // 0x111
    RIE_U8 cfg_112_r;                    // 0x112
    RIE_U8 cfg_113_r;                    // 0x113
    RIE_U8 radio_cfg_8_r;                // 0x114
    RIE_U8 radio_cfg_9_r;                // 0x115
    RIE_U8 cfg_116_r;                    // 0x116
    RIE_U8 cfg_117_r;                    // 0x117
    RIE_U8 image_reject_cal_phase_r;     // 0x118
    RIE_U8 image_reject_cal_amplitude_r; // 0x119
    RIE_U8 cfg_11A_r;                    // 0x11A
    RIE_U8 cfg_11B_r;                    // 0x11B
    RIE_U8 symbol_mode_r;                // 0x11C
    RIE_U8 cfg_11D_r;                    // 0x11D
    RIE_U8 cfg_11E_r;                    // 0x11E
    RIE_U8 cfg_11F_r;                    // 0x11F
    RIE_U8 cfg_120_r;                    // 0x120
    RIE_U8 cfg_121_r;                    // 0x121
    RIE_U8 cfg_122_r;                    // 0x122
    RIE_U8 cfg_123_r;                    // 0x123
    RIE_U8 tx_base_adr_r;                // 0x124
    RIE_U8 rx_base_adr_r;                // 0x125
    RIE_U8 packet_length_control_r;      // 0x126
    RIE_U8 packet_length_max_r;          // 0x127
    RIE_U8 cfg_128_r;                    // 0x128
    RIE_U8 cfg_129_r;                    // 0x129
    RIE_U8 cfg_12A_r;                    // 0x12A
    RIE_U8 cfg_12B_r;                    // 0x12B
    RIE_U8 cfg_12C_r;                    // 0x12C
    RIE_U8 cfg_12D_r;                    // 0x12D
    RIE_U8 cfg_12E_r;                    // 0x12E
    RIE_U8 cfg_12F_r;                    // 0x12F
    RIE_U8 cfg_130_r;                    // 0x130
    RIE_U8 cfg_131_r;                    // 0x131
    RIE_U8 cfg_132_r;                    // 0x132
    RIE_U8 cfg_133_r;                    // 0x133
    RIE_U8 cfg_134_r;                    // 0x134
    RIE_U8 cfg_135_r;                    // 0x135
    RIE_U8 cfg_136_r;                    // 0x136
    RIE_U8 cfg_137_r;                    // 0x137
    RIE_U8 cfg_138_r;                    // 0x138
    RIE_U8 cfg_139_r;                    // 0x139
    RIE_U8 cfg_13A_r;                    // 0x13A
    RIE_U8 cfg_13B_r;                    // 0x13B
    RIE_U8 cfg_13C_r;                    // 0x13C
    RIE_U8 cfg_13D_r;                    // 0x13D
    RIE_U8 cfg_13E_r;                    // 0x13E
    RIE_U8 cfg_13F_r;                    // 0x13F
} TyRadioConfiguration;
/*************************************************************************/
/*                        Radio Configuration Constants                  */
/*************************************************************************/
#define interrupt_mask_0_interrupt_tx_eof                (0x1 << 4)
#define interrupt_mask_0_interrupt_crc_correct           (0x1 << 2)

#define packet_length_control_length_offset_offset       (0)
#define packet_length_control_length_offset_minus0       (0x4 << packet_length_control_length_offset_offset)
#define packet_length_control_data_mode_offset           (3)
#define packet_length_control_data_mode_packet           (0x0 << packet_length_control_data_mode_offset)
#define packet_length_control_crc_en_yes                 (0x1 << 5)
#define packet_length_control_packet_len_variable        (0x0 << 6)
#define packet_length_control_packet_len_fixed           (0x1 << 6)
